name: "bert_batch"
backend: "python"
max_batch_size: 8

input [
    {
        name: "text"
        data_type: TYPE_STRING
        dims: [-1]
    },
    {
        name: "max_length"
        data_type: TYPE_INT32
        dims: [1]
    }
]

output [
    {
        name: "embedding"
        data_type: TYPE_STRING
        dims: [-1]
    }
]

dynamic_batching {
    preferred_batch_size: [ 1, 4, 8 ],
    max_queue_delay_microseconds: 5000   # 等待时间
}

instance_group [
    {
        count: 1
        kind : KIND_GPU
        gpus: [0]
    }
]

parameters {
  key: "tokenizer_dir"
  value: {
    string_value: "/mnt/publish-data/pretrain_models/bert/bce-embedding-base_v1/"
  }
}
parameters {
    key: "engine_dir"
    value: {
        string_value: "/data/caiyueliang/tensorrt-llm/examples/bert/bce-embedding-trt-llm-fp16-mbs128-obs1/RobertaModel_float16_tp1_rank0.engine"
    }
}