name: "ensemble"
platform: "ensemble"
max_batch_size: 8
input [
    {
        name: "text"
        data_type: TYPE_STRING
        dims: [-1]
    },
    {
        name: "max_length"
        data_type: TYPE_INT32
        dims: [1]
    }
    ]

output [
{
    name: "label"
    data_type: TYPE_INT32
    dims: [1]
},
{
    name: "score"
    data_type: TYPE_FP32
    dims: [1]
}
]

ensemble_scheduling {
step [
    {
    model_name: "preprocessing"
    model_version: 1
    input_map {
        key: "text"
        value: "text"
    }
    input_map {
        key: "max_length"
        value: "max_length"
    }
    output_map {
        key: "input_ids"
        value: "input_ids"
    }
    output_map {
        key: "input_lengths"
        value: "input_lengths"
    }
    output_map {
        key: "token_type_ids"
        value: "token_type_ids"
    }
    },
    {
    model_name: "tensorrt_llm"
    model_version: 1
    input_map {
        key: "input_ids"
        value: "input_ids"
    }
    input_map {
        key: "input_lengths"
        value: "input_lengths"
    }
    input_map {
        key: "token_type_ids"
        value: "token_type_ids"
    }
    output_map {
        key: "label"
        value: "label"
    }
    output_map {
        key: "score"
        value: "score"
    }
    }
]
}